<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of KensingtonWorks and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.prausch.munki.KensingtonWorks</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>KensingtonWorks </string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>KensingtonWorks</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>KensingtonWorks Helper (Plugin).app</string>
				<string>KensingtonWorksHelper.app</string>
				<string>KensingtonWorks Helper.app</string>
				<string>KensingtonWorks Uninstaller.app</string>
				<string>KensingtonWorks .app</string>
				<string>KensingtonWorks Helper (Renderer).app</string>
				<string>KensingtonWorks Helper (GPU).app</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string> </string>
			<key>developer</key>
			<string>Kensington Computer Products Group</string>
			<key>display_name</key>
			<string>KensingtonWorks</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>3.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.prausch.download.KensingtonWorks</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
